export const fishDict = [
         {
           fish: "Лещ",
           habitats: "Реки, Озера, Пруды, Водохранилища, Каналы",
           max_length: "80 см",
           max_weight: "15 кг",
           life_period: "15 - 25 лет",
           description: `то пресноводная рыба, которая обладает характерным внешним видом. Вот некоторые особенности и описание леща:
Размер и форма: Лещ имеет стройное тело с высоким боком и сжатым с боков профилем. Его форма напоминает толстую и слегка сплющенную сторонами платискообразную рыбу. Взрослые особи могут достигать длины около 30-50 см, хотя иногда бывают и более крупные особи.

Окраска: Спина леща обычно темно-зеленая или серо-зеленая, переходящая в серебристые или белые оттенки на боках и животе. В светлой воде его окраска может быть более яркой и блестящей.

Чешуя: Лещ имеет крупную и плотно прилегающую чешую, которая может иметь золотистый или зеленоватый оттенок. Чешуя обычно гладкая на ощупь.

Плавники: Лещ имеет два спинных плавника — первый с твердыми лучами, а второй с мягкими. Грудные и брюшные плавники также присутствуют и имеют ярко-желтую или оранжевую окраску.

Голова: Голова леща относительно небольшая, с небольшим ртом, расположенным немного ниже нижней челюсти. Глаза крупные и золотисто-желтые.

Пищеварительная система: Лещ является всеядной рыбой, питается как растительной, так и животной пищей. Его пищеварительная система адаптирована для переваривания различных типов пищи, включая водоросли, мелкие беспозвоночных, червей, насекомых и рыбий икру.
Лещ является ценной промысловой и спортивной рыбой. Он известен своей сильной борьбой при ловле на удочку и является популярной целью для любителей рыбной ловли.`, // описание леща
           bait: "Червь, Мотыль, Поддонки, Опарыш, Кукуруза, Донкар",
           img: require("../img/fish1.jpg"),
         },
         {
           fish: "Сом",
           habitats:
             "Реки, Озёра, Водохранилища, Каналы и ирригационные системы",
           max_length: "500 см",
           max_weight: "300 кг",
           life_period: "20 - 60 лет",
           description: `Это крупная пресноводная рыба с характерным внешним видом. Вот некоторые особенности и описание сома:
Размер и форма: Сом является одной из самых крупных пресноводных рыб в Европе. Взрослые особи могут достигать вп impression длины от 1,5 до 2,5 метров и иметь вес от нескольких десятков до нескольких сотен килограммов. Они имеют длинное, цилиндрическое и мощное тело.

Окраска: Обычно сомы имеют темную окраску, которая может варьироваться от серо-коричневой до черной. Они обычно имеют темные пятна или полосы на теле, которые помогают им скрываться среди обстановки на дне водоема.

Голова: У сома большая и широкая голова с широким ртом, оснащенным мощными челюстями. На подбородке у многих сомов есть пара бородковых щупалец, которые помогают им чувствовать окружающую среду и находить пищу.

Чешуя: Сомы покрыты мелкой и твердой чешуей, которая помогает им защищаться от повреждений и дает им некоторую защиту.

Плавники: Сом имеет многочисленные плавники. Они имеют два длинных усикообразных усика на верхней губе и пару боковых усиков на нижней челюсти. У них есть один спинной плавник, который проходит почти по всей длине спины, и хвостовой плавник, который помогает им маневрировать и передвигаться в воде.

Пищеварительная система: Сомы являются хищниками и питаются разнообразной пищей, включая рыбу, лягушек, водных грызунов и даже птиц. У них развитый обонятельный аппарат, что помогает им находить добычу в темных водах.`, // описание сома
           bait:
             "Живая рыба, Мертвая рыба, Караси и Судаки, Куски мяса, Креветки, Крабы, Воблеры",
           img: require("../img/fish2.jpg"),
         },
         {
           fish: "Окунь",
           habitats:
             "Пресные и слабосоленые воды, Реки, Озера, Овраги, Водохранилища",
           max_length: "50 см",
           max_weight: "3 кг",
           life_period: "9 - 15 лет",
           description: `пресноводная рыба, которая обладает характерным внешним видом и поведением. Вот общее описание окуня:
Форма тела: Окунь имеет стройную и боково сплюснутую форму тела. Оно вытянутое и слегка овальное, с высоким гребнем спины.

Окраска: Окраска окуня может варьировать в зависимости от условий обитания, но обычно у него зеленовато-серый верх и серебристый бок с чередующимися темными полосами или пятнами.

Плавники: Окунь имеет два спинных плавника, один перед глазами и второй ближе к хвосту. У него также есть анальный плавник и пара грудных плавников. Все плавники окуня имеют острые шипы.

Очи: Окунь обладает большими, выступающими глазами. Они помогают ему охотиться и ориентироваться в воде.

Рот: Рот окуня довольно широкий и оснащен острыми зубами. Это позволяет ему эффективно ловить свою добычу.

Размер: Окунь может достигать длины до 50 сантиметров, но обычно их размер составляет от 20 до 30 сантиметров.

Поведение: Окунь является активной хищной рыбой. Он питается мелкой рыбой, насекомыми и другими водными организмами. Окунь обычно охотится в близкой около дна воды, используя стратегию подстерегающего удара.

Распространение: Окунь обитает в пресноводных водоемах Европы, Азии и Северной Америки. Он может встречаться как в мелких реках и озерах, так и в крупных водохранилищах.
Окунь является популярной рыбой для рекреационной рыбалки благодаря своей активности и хорошему вкусу мяса."`,
           bait:
             "Воблеры, Блесны, Мягкие приманки, Живая рыба, Черви, Мотыль, Раки, Креветки",
           img: require("../img/fish3.jpg"),
         },
         {
           fish: "Щука",
           habitats:
             "Реки, Ручья, Озера, Водохранилища, Болота и заросли, Прибрежные зоны моря",
           max_length: "150 см",
           max_weight: "30 кг",
           life_period: "10 - 20 лет",
           description: `это крупная пресноводная рыба, которая обладает характерным внешним видом. Вот описание щуки:
Размер и форма: Щука имеет продолговатое тело с крупной головой. Её тело вытянутое и стройное, с боками сжатыми с боков. Размеры щуки могут варьироваться, но обычно взрослые особи достигают от 50 до 100 сантиметров в длину.

Окраска: Щука имеет характерную окраску, состоящую из зеленовато-желтого или зеленовато-серого цвета спины и бока с тёмными пятнами или полосами. Брюшная сторона щуки белая или серебристая. Такой окрас помогает рыбе маскироваться в воде.

Плавники: У щуки есть несколько плавников. Дорсальный (спинной) плавник находится на спине и расположен ближе к хвосту. Анальный плавник находится на нижней стороне тела, ближе к хвосту. Плавники окрашены в серый или жёлтый цвет.

Зубы: Щука обладает большим количеством острых зубов. Её зубы ориентированы назад, что помогает ей ловить и удерживать добычу.

Глаза: Глаза щуки крупные и расположены высоко на голове. Это позволяет щуке хорошо видеть свою добычу и охотиться в различных условиях.

Пищеварительная система: Щука является хищной рыбой и питается главным образом мелкой рыбой, а также лягушками, водными грызунами и насекомыми. У неё длинный желудок, способный вместить большую порцию пищи.

Щука является одной из наиболее известных и распространенных пресноводных рыб. Она обладает отличными хищными способностями и является популярной целью для рыболовов`,
           bait:
             "Живая рыба, Рыбные кусочки, Имитационные приманки, Большой живой червь",
           img: require("../img/fish4.jpg"),
         },
         {
           fish: "Сазан",
           habitats:
             "Реки, Ручья, Озера, Пруды, Водохранилища, Карьеры и старицы",
           max_length: "150 см",
           max_weight: "30 кг",
           life_period: "10 - 40 лет",
           description: `это крупная пресноводная рыба, которая широко распространена по всему миру. Вот основные характеристики и описание сазана:
Внешний вид: Сазан имеет вытянутое тело со слегка боковым сжатием. Окраска может варьироваться от бледно-желтого до темно-коричневого цвета, в зависимости от окружающей среды и генетических факторов. У некоторых особей на теле могут быть темные пятна или штрихи. Чешуя сазана крупная и покрыта слизью.

Рот и усики: Сазан имеет широкий рот с мощными челюстями. На верхней губе у сазана расположены два пары усиков - более короткие надверхнечелюстные усики и более длинные подчелюстные усики. Усики помогают сазану находить пищу и ориентироваться в окружающей среде.

Размеры: Сазаны могут достигать значительных размеров. В среднем, длина сазана составляет от 40 до 80 сантиметров, но некоторые особи могут вырасти до 1 метра и более. Вес сазана варьируется от нескольких килограммов до более 30 килограммов.

Питание: Сазаны являются всеядными рыбами и питаются разнообразной пищей. Они могут поедать растительную пищу, такую как водоросли, растения и семена, а также животную пищу, включая насекомых, червей, моллюсков и мелкую рыбу.

Поведение: Сазаны обитают в различных пресноводных водоемах и предпочитают медленно текущие или стоячие воды с достаточным количеством укрытий и растительности. Они могут образовывать стаи и проводить большую часть времени в поисках пищи.

Сазаны являются популярными объектами рыболовства и активно разводятся в прудах и рыбоводных хозяйствах. Они также имеют важное значение в экосистемах водоемов, где выполняют роль распространителей семян растений и контролируют население насекомых и моллюсков."`,
           bait:
             "Черви, Прикормка и паста, Кукуруза, Полусливки и фрукты, Искусственные приманки",
           img: require("../img/fish5.jpg"),
         },
         {
           fish: "Жерех",
           habitats:
             "Реки, Озера, Болота и Заболоченные участки, Прибрежные зоны",
           max_length: "70 см",
           max_weight: "8 кг",
           life_period: "10 - 20 лет",
           description: `это пресноводная рыба, принадлежащая семейству карповых. Вот общее описание жереха:
Внешний вид: Жерех имеет стройное тело с боковым сжатием. Окраска спины может варьироваться от зеленовато-серой до синевато-серой, а брюшная сторона белая. Боковые части тела часто имеют серебристый оттенок. У жереха есть большой рот с острыми зубами.

Размер: Жерех обычно достигает длины от 30 до 50 см, но максимальная длина может достигать около 70 см. Вес взрослых особей обычно составляет от 1 до 3 кг, но максимальный вес может быть около 6-8 кг.

Поведение и образ жизни: Жерех является активной рыбой, предпочитающей быстрые течения и чистую воду. Он обитает в реках, озерах и водохранилищах. Жерехи обычно формируют стаи и питаются разнообразными водными животными, включая насекомых, моллюсков, рыбью икру и маленьких рыб.

Размножение: Жерехы достигают половой зрелости примерно в возрасте 3-4 лет. Их размножение происходит весной, когда они мигрируют в реки для нереста. Жерехи откладывают яйца на водоросли или другие подводные предметы. В зависимости от условий, самка может отложить от нескольких тысяч до нескольких десятков тысяч яиц.

Жерех - популярная рыба для ловли спортивными методами, такими как спиннинг и муховязание. Она ценится за свою силу и боевой характер при ловле`,
           bait:
             "Черви, Мотыль, Кукуруза, Искусственные приманки, Мотыльные гусеницы ",
           img: require("../img/fish6.jpg"),
         },
       ];
